cool/tutorials/compressible/rhopSonicFoam/wedge15Ma5/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.15242 0       -0.005)
    ( 0       0       -0.005)
    ( 0.3048  0.081670913853  -0.005)
    (-0.15242 0.1524 -0.005)
    ( 0       0.1524 -0.005)
    ( 0.3048  0.1524 -0.005)

    (-0.15242 0        0.005)
    ( 0       0        0.005)
    ( 0.3048  0.081670913853 0.005)
    (-0.15242 0.1524  0.005)
    ( 0       0.1524  0.005)
    ( 0.3048  0.1524  0.005)

);

blocks
(
    hex (0 1 4 3 6 7 10 9 ) (40 40 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) (80 40 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 6 9 3)
    )
    patch outlet
    (
        (2 5 11 8)
    )
    symmetryPlane bottom
    (
        (0 1 7 6)
    )
    symmetryPlane top
    (
        (3 9 10 4)
        (4 10 11 5)
    )
    patch obstacle
    (
        (1 2 8 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
