cool/tutorials/compressible/rhopSonicFoam/wedge15Ma5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       9440;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       9480;
    }
    bottom
    {
        type            symmetryPlane;
        nFaces          40;
        startFace       9520;
    }
    top
    {
        type            symmetryPlane;
        nFaces          120;
        startFace       9560;
    }
    obstacle
    {
        type            patch;
        nFaces          80;
        startFace       9680;
    }
    defaultFaces
    {
        type            empty;
        nFaces          9600;
        startFace       9760;
    }
)

// ************************************************************************* //
